app/controllers/data_files_controller.rb

  def index
    @data_files = DataFile.all
---
SELECT * FROM `data_files`

  def show
    @data_file = DataFile.find(params[:id])
---
SELECT * FROM `data_files` WHERE (`data_files`.`id` = 31)

  def destroy
    @data_file = DataFile.find(params[:id])
    @data_file.destroy
---
SELECT * FROM `data_files` WHERE (`data_files`.`id` = 23)
DELETE FROM `data_files` WHERE `id` = 23

  def uploadFile
    @name = params[:data_file][:title]
    unless(params[:small_banner].nil? && params[:large_banner].nil?)
      post = DataFile.save( params[:small_banner],params[:large_banner],@name)
---
INSERT INTO `data_files` (`updated_at`, `title`, `description`, `created_at`) VALUES('2011-07-21 14:27:26', 'sadsad', 'asdasdasd', '2011-07-21 14:27:26')